---
kind: type
id: T:Autodesk.Revit.Exceptions.FileAccessException
source: html/187d56d7-0b37-699f-2abd-6ddebfa93f1e.htm
---
# Autodesk.Revit.Exceptions.FileAccessException

The exception that is thrown when the specified file could not be accessed, e.g. read-only, locked by the OS etc.

## Syntax (C#)
```csharp
[SerializableAttribute]
public class FileAccessException : IOException
```